{
  "resourceType": "CodeSystem",
  "id": "ref-name",
  "url": "https://bind.codes/ref-name",
  "name": "RefName",
  "title": "Ref Name",
  "status": "draft",
  "language": "en",
  "description": "Ref Name codes for insurance operations.",
  "concept": [
    {
      "code": "AffiliationRefs",
      "display": "This attribute is an identifier reference to an organization with whom a person has an affiliation.",
      "definition": "This attribute is an identifier reference to an organization with whom a person has an affiliation. — ref name code."
    },
    {
      "code": "AggregateRef",
      "display": "This attribute is an identifier reference to an aggregate or element to which this item is associated.",
      "definition": "This attribute is an identifier reference to an aggregate or element to which this item is associated. — ref name code."
    },
    {
      "code": "AppraiserRef",
      "display": "This attribute is an identifier reference to an appraiser.",
      "definition": "This attribute is an identifier reference to an appraiser. — ref name code."
    },
    {
      "code": "AssignmentRef",
      "display": "This attribute contains an identifier reference to ClaimsParty, Coverage, AutoLossInfo, LiabilityLossInfo, PropertyLossInfo, etc. to which this adjuster has been assigned.",
      "definition": "This attribute contains an identifier reference to ClaimsParty, Coverage, AutoLossInfo, LiabilityLossInfo, PropertyLossInfo, etc. to which this adjuster has been assigned. — ref name code."
    },
    {
      "code": "AssignmentRefs",
      "display": "This attribute contains one or more identifier reference(s) to ClaimsParty, Coverage, AutoLossInfo, LiabilityLossInfo, PropertyLossInfo to which this adjuster has been assigned.",
      "definition": "This attribute contains one or more identifier reference(s) to ClaimsParty, Coverage, AutoLossInfo, LiabilityLossInfo, PropertyLossInfo to which this adjuster has been assigned. — ref name code."
    },
    {
      "code": "AuditorRef",
      "display": "This attribute is an identifier reference to a <MiscParty> that is the person or organization that performed or will perform an audit.",
      "definition": "This attribute is an identifier reference to a <MiscParty> that is the person or organization that performed or will perform an audit. — ref name code."
    },
    {
      "code": "AuthorizedRepRef",
      "display": "This attribute is an identifier reference to a ClaimsParty that is an attorney or authorized representative of this individual.",
      "definition": "This attribute is an identifier reference to a ClaimsParty that is an attorney or authorized representative of this individual. — ref name code."
    },
    {
      "code": "BaseTerminalRef",
      "display": "This attribute is an identifier reference to a base terminal.",
      "definition": "This attribute is an identifier reference to a base terminal. — ref name code."
    },
    {
      "code": "BldgExposureRef",
      "display": "This attribute is an identifier reference to a building exposure.",
      "definition": "This attribute is an identifier reference to a building exposure. — ref name code."
    },
    {
      "code": "BuyerRef",
      "display": "This attribute is an Identifier Reference to a buyer of an object.",
      "definition": "This attribute is an Identifier Reference to a buyer of an object. — ref name code."
    },
    {
      "code": "CertifyingPartyRef",
      "display": "This attribute is an identifier reference to a miscellaneous party that certified the item.",
      "definition": "This attribute is an identifier reference to a miscellaneous party that certified the item. — ref name code."
    },
    {
      "code": "ClaimsParty1Ref",
      "display": "This attribute is an identifier reference to a ClaimsParty.",
      "definition": "This attribute is an identifier reference to a ClaimsParty. — ref name code."
    },
    {
      "code": "ClaimsParty2Ref",
      "display": "This attribute is an identifier reference to a ClaimsParty.",
      "definition": "This attribute is an identifier reference to a ClaimsParty. — ref name code."
    },
    {
      "code": "ClaimsPartyRef",
      "display": "This attribute is an identifier reference to a ClaimsParty.",
      "definition": "This attribute is an identifier reference to a ClaimsParty. — ref name code."
    },
    {
      "code": "ClaimsPartyRefs",
      "display": "This attribute is an identifier reference to a ClaimsParty.",
      "definition": "This attribute is an identifier reference to a ClaimsParty. — ref name code."
    },
    {
      "code": "ClaimsPartyRoleRef",
      "display": "This attribute is an identifier reference to the role of the claims party associated with this information.",
      "definition": "This attribute is an identifier reference to the role of the claims party associated with this information. — ref name code."
    },
    {
      "code": "ClaimsReviewerRefs",
      "display": "This attribute is a multiple identifier reference to the individual(s) who review claims.",
      "definition": "This attribute is a multiple identifier reference to the individual(s) who review claims. — ref name code."
    },
    {
      "code": "CodeListRef",
      "display": "A Reference to the Identifier of the <CodeList>",
      "definition": "A Reference to the Identifier of the <CodeList> — ref name code."
    },
    {
      "code": "CommlIMLocationRef",
      "display": "This attribute is an identifier reference to a commercial inland marine location.",
      "definition": "This attribute is an identifier reference to a commercial inland marine location. — ref name code."
    },
    {
      "code": "ContainedInSafeVaultRef",
      "display": "This attribute is an identifier reference to the safe or vault in which this item is contained. For instance, a safe is often contained within a vault.",
      "definition": "This attribute is an identifier reference to the safe or vault in which this item is contained. For instance, a safe is often contained within a vault. — ref name code."
    },
    {
      "code": "ConversionRateRef",
      "display": "This attribute is an identifier reference to a conversion rate.",
      "definition": "This attribute is an identifier reference to a conversion rate. — ref name code."
    },
    {
      "code": "CoverageRefs",
      "display": "This attribute is an identifier reference to <CommlCoverage> or <Coverage>Coverage aggregates.",
      "definition": "This attribute is an identifier reference to <CommlCoverage> or <Coverage>Coverage aggregates. — ref name code."
    },
    {
      "code": "DockLocationRef",
      "display": "This attribute is an identifier reference to a dock location.",
      "definition": "This attribute is an identifier reference to a dock location. — ref name code."
    },
    {
      "code": "DriverNameRef",
      "display": "This attribute is an identifier reference to a driver name.",
      "definition": "This attribute is an identifier reference to a driver name. — ref name code."
    },
    {
      "code": "DriverRef",
      "display": "This attribute is an identifier reference to a driver.",
      "definition": "This attribute is an identifier reference to a driver. — ref name code."
    },
    {
      "code": "DriverRefs",
      "display": "This attribute is an identifier reference to a driver.",
      "definition": "This attribute is an identifier reference to a driver. — ref name code."
    },
    {
      "code": "DriverVehRefs",
      "display": "This attribute is an identifier reference to a driver vehicle aggregate.",
      "definition": "This attribute is an identifier reference to a driver vehicle aggregate. — ref name code."
    },
    {
      "code": "DwellRefs",
      "display": "This attribute is an identifier reference to a dwelling.",
      "definition": "This attribute is an identifier reference to a dwelling. — ref name code."
    },
    {
      "code": "EmployeeRef",
      "display": "This attribute is an identifier reference to a name.",
      "definition": "This attribute is an identifier reference to a name. — ref name code."
    },
    {
      "code": "ErrorRefs",
      "display": "This attribute is an identifier reference to an error. This can reference any aggregate/element within the message that may be the source of the error.",
      "definition": "This attribute is an identifier reference to an error. This can reference any aggregate/element within the message that may be the source of the error. — ref name code."
    },
    {
      "code": "FarmLiabilityRefs",
      "display": "This attribute is an identifier reference to a farm liability.",
      "definition": "This attribute is an identifier reference to a farm liability. — ref name code."
    },
    {
      "code": "FleetRef",
      "display": "This attribute is a reference identifier to a fleet.",
      "definition": "This attribute is a reference identifier to a fleet. — ref name code."
    },
    {
      "code": "HeatingUnitRef",
      "display": "This attribute is an identifier reference to a heating unit.",
      "definition": "This attribute is an identifier reference to a heating unit. — ref name code."
    },
    {
      "code": "IdRef",
      "display": "This attribute is an identifier reference to a specific element within the stream.",
      "definition": "This attribute is an identifier reference to a specific element within the stream. — ref name code."
    },
    {
      "code": "IdRefs",
      "display": "This attribute is an identifier reference to a specific element within the stream.",
      "definition": "This attribute is an identifier reference to a specific element within the stream. — ref name code."
    },
    {
      "code": "ImpoundAgencyRef",
      "display": "This attribute is an identifier reference to an Impounding Agency.",
      "definition": "This attribute is an identifier reference to an Impounding Agency. — ref name code."
    },
    {
      "code": "ImpoundFacilityRef",
      "display": "This attribute is an identifier reference to an Impounding Facility.",
      "definition": "This attribute is an identifier reference to an Impounding Facility. — ref name code."
    },
    {
      "code": "InjuredTakenRef",
      "display": "This attribute is an identifier reference to ClaimsParty containing the address the injured party was taken to following the injury.",
      "definition": "This attribute is an identifier reference to ClaimsParty containing the address the injured party was taken to following the injury. — ref name code."
    },
    {
      "code": "InspectionPartyRefs",
      "display": "This attribute is a multiple identifier reference to miscellaneous party aggregates associated with an inspection.",
      "definition": "This attribute is a multiple identifier reference to miscellaneous party aggregates associated with an inspection. — ref name code."
    },
    {
      "code": "InstallingPartyRef",
      "display": "This attribute is an identifier reference to a miscellaneous party that installed the item.",
      "definition": "This attribute is an identifier reference to a miscellaneous party that installed the item. — ref name code."
    },
    {
      "code": "InsuredNameRef",
      "display": "This attribute is an identifier reference to an insured name.",
      "definition": "This attribute is an identifier reference to an insured name. — ref name code."
    },
    {
      "code": "InvestigatorRef",
      "display": "This attribute is an identifier reference to an investigator.",
      "definition": "This attribute is an identifier reference to an investigator. — ref name code."
    },
    {
      "code": "ItemRef",
      "display": "This attribute is an identifier reference to an item.",
      "definition": "This attribute is an identifier reference to an item. — ref name code."
    },
    {
      "code": "LocationRef",
      "display": "This attribute is an identifier reference to a location.",
      "definition": "This attribute is an identifier reference to a location. — ref name code."
    },
    {
      "code": "LossPayeeRef",
      "display": "This attribute is an identifier reference to a ClaimsParty that is the loss payee or mortgagee of this vehicle or property.",
      "definition": "This attribute is an identifier reference to a ClaimsParty that is the loss payee or mortgagee of this vehicle or property. — ref name code."
    },
    {
      "code": "MaintenanceSupervisorRef",
      "display": "This attribute is an identifier reference to a maintenance supervisor.",
      "definition": "This attribute is an identifier reference to a maintenance supervisor. — ref name code."
    },
    {
      "code": "MiscPartyRefs",
      "display": "This attribute is an identifier reference to a <MiscParty>.",
      "definition": "This attribute is an identifier reference to a <MiscParty>. — ref name code."
    },
    {
      "code": "NameInfoRef",
      "display": "This attribute is an identifier reference to a name.",
      "definition": "This attribute is an identifier reference to a name. — ref name code."
    },
    {
      "code": "NameInfoRefs",
      "display": "This attribute is an identifier reference to a name(s).",
      "definition": "This attribute is an identifier reference to a name(s). — ref name code."
    },
    {
      "code": "OtherOrPriorPolicyRef",
      "display": "This attribute is an identifier reference to an underlying policy.",
      "definition": "This attribute is an identifier reference to an underlying policy. — ref name code."
    },
    {
      "code": "OwnerRef",
      "display": "This attribute is an identifier reference to a ClaimsParty.",
      "definition": "This attribute is an identifier reference to a ClaimsParty. — ref name code."
    },
    {
      "code": "PayorRef",
      "display": "This attribute is an identifier reference to a payor.",
      "definition": "This attribute is an identifier reference to a payor. — ref name code."
    },
    {
      "code": "PlaintiffRefs",
      "display": "This attribute is an identifier reference to a ClaimsParty that is a plaintiff(s).",
      "definition": "This attribute is an identifier reference to a ClaimsParty that is a plaintiff(s). — ref name code."
    },
    {
      "code": "PortOriginRef",
      "display": "This attribute is an identifier reference a Port of Origin of a shipment.",
      "definition": "This attribute is an identifier reference a Port of Origin of a shipment. — ref name code."
    },
    {
      "code": "PreferredContactRef",
      "display": "This attribute is an identifier reference to the preferred time and date that the information in this aggregate should be used.",
      "definition": "This attribute is an identifier reference to the preferred time and date that the information in this aggregate should be used. — ref name code."
    },
    {
      "code": "PreviousRefs",
      "display": "This attribute is an identifier reference to previously referenced elements within the stream.",
      "definition": "This attribute is an identifier reference to previously referenced elements within the stream. — ref name code."
    },
    {
      "code": "PrincipalAddrRef",
      "display": "This attribute is an identifier reference to the principle <Addr> of the plan located in the <InsuredOrPrincipal> aggregate.",
      "definition": "This attribute is an identifier reference to the principle <Addr> of the plan located in the <InsuredOrPrincipal> aggregate. — ref name code."
    },
    {
      "code": "ProducerRefs",
      "display": "This attribute is an identifier to a producer.",
      "definition": "This attribute is an identifier to a producer. — ref name code."
    },
    {
      "code": "PropScheduleRefs",
      "display": "This attribute is an identifier reference to a property schedule aggregate. This includes summary and scheduled item information.",
      "definition": "This attribute is an identifier reference to a property schedule aggregate. This includes summary and scheduled item information. — ref name code."
    },
    {
      "code": "PropSummaryRef",
      "display": "This attribute is an identifier reference to PropertySchedule aggregate which has IsSummaryInd='1'.",
      "definition": "This attribute is an identifier reference to PropertySchedule aggregate which has IsSummaryInd='1'. — ref name code."
    },
    {
      "code": "RatedDriverRef",
      "display": "This attribute is an identifier reference to a rated driver.",
      "definition": "This attribute is an identifier reference to a rated driver. — ref name code."
    },
    {
      "code": "RecoveryAgencyRef",
      "display": "This attribute is an identifier reference to a recovery agency.",
      "definition": "This attribute is an identifier reference to a recovery agency. — ref name code."
    },
    {
      "code": "RegisteredOwnerRef",
      "display": "This attribute is an identifier reference to a registered owner.",
      "definition": "This attribute is an identifier reference to a registered owner. — ref name code."
    },
    {
      "code": "RelatedToLocationRefs",
      "display": "This attribute is an identifier reference(s) to the <Location> for which relationship information is being provided.",
      "definition": "This attribute is an identifier reference(s) to the <Location> for which relationship information is being provided. — ref name code."
    },
    {
      "code": "RelatedToSubLocationRefs",
      "display": "This attribute is an identifier reference(s) to the <Sublocation> for which relationship information is being provided.",
      "definition": "This attribute is an identifier reference(s) to the <Sublocation> for which relationship information is being provided. — ref name code."
    },
    {
      "code": "ReportedByRef",
      "display": "This attribute is an identifier reference to a ClaimsParty or InsuredOrPrincipal that this claim was reported by.",
      "definition": "This attribute is an identifier reference to a ClaimsParty or InsuredOrPrincipal that this claim was reported by. — ref name code."
    },
    {
      "code": "ReportedToRef",
      "display": "This attribute is an identifier reference to a ClaimsParty or InsuredOrPrincipal that this claim was reported to.",
      "definition": "This attribute is an identifier reference to a ClaimsParty or InsuredOrPrincipal that this claim was reported to. — ref name code."
    },
    {
      "code": "SafetySupervisorRef",
      "display": "This attribute is an identifier reference to a safety supervisor.",
      "definition": "This attribute is an identifier reference to a safety supervisor. — ref name code."
    },
    {
      "code": "SalvageAgencyRef",
      "display": "This attribute is an Identifier Reference to a salvage agency.",
      "definition": "This attribute is an Identifier Reference to a salvage agency. — ref name code."
    },
    {
      "code": "SecondInjuryFundRef",
      "display": "This attribute is an identifier reference to a specific second injury fund source.",
      "definition": "This attribute is an identifier reference to a specific second injury fund source. — ref name code."
    },
    {
      "code": "SPFieldEditRefs",
      "display": "Transient Id for a Field Edit.",
      "definition": "Transient Id for a Field Edit. — ref name code."
    },
    {
      "code": "SPRelationalEditRefs",
      "display": "Transient Id for a Relational Edit",
      "definition": "Transient Id for a Relational Edit — ref name code."
    },
    {
      "code": "StorageLocationRef",
      "display": "This attribute is an identifier reference to a storage location.",
      "definition": "This attribute is an identifier reference to a storage location. — ref name code."
    },
    {
      "code": "StructureRefs",
      "display": "This attribute is an identifier reference to a structure.",
      "definition": "This attribute is an identifier reference to a structure. — ref name code."
    },
    {
      "code": "SubcontractorRef",
      "display": "This attribute is an identifier reference to a <MiscParty> that is the subcontractor.",
      "definition": "This attribute is an identifier reference to a <MiscParty> that is the subcontractor. — ref name code."
    },
    {
      "code": "SubLocationRef",
      "display": "This attribute is an identifier reference to a sublocation.",
      "definition": "This attribute is an identifier reference to a sublocation. — ref name code."
    },
    {
      "code": "TerminalRef",
      "display": "This attribute is an identifier reference to a <MiscParty> containing the name and address of the Terminal.",
      "definition": "This attribute is an identifier reference to a <MiscParty> containing the name and address of the Terminal. — ref name code."
    },
    {
      "code": "TowingRef",
      "display": "This attribute is an identifier reference to the vehicle that is towing this vehicle. (This would typically be used for trailers).",
      "definition": "This attribute is an identifier reference to the vehicle that is towing this vehicle. (This would typically be used for trailers). — ref name code."
    },
    {
      "code": "TrailerTrainVehRefs",
      "display": "This attribute is a multiple identifier reference to a vehicle that forms part of a trailer train.",
      "definition": "This attribute is a multiple identifier reference to a vehicle that forms part of a trailer train. — ref name code."
    },
    {
      "code": "UnionRef",
      "display": "This attribute is an identifier reference to a Union.",
      "definition": "This attribute is an identifier reference to a Union. — ref name code."
    },
    {
      "code": "VehPrincipallyDrivenRef",
      "display": "This attribute is an identifier reference to the vehicle principally driven.",
      "definition": "This attribute is an identifier reference to the vehicle principally driven. — ref name code."
    },
    {
      "code": "VehRef",
      "display": "This attribute is an identifier reference to a vehicle.",
      "definition": "This attribute is an identifier reference to a vehicle. — ref name code."
    },
    {
      "code": "VehRefs",
      "display": "This attribute is an identifier reference to a vehicle.",
      "definition": "This attribute is an identifier reference to a vehicle. — ref name code."
    },
    {
      "code": "ViewItemRef",
      "display": "This attribute is an identifier reference to a ClaimsParty which contains the information about where and when this item can be viewed.",
      "definition": "This attribute is an identifier reference to a ClaimsParty which contains the information about where and when this item can be viewed. — ref name code."
    },
    {
      "code": "WatercraftAccessoryRefs",
      "display": "This attribute is an identifier reference to a watercraft accessory aggregate. This includes motors, trailers, and equipment.",
      "definition": "This attribute is an identifier reference to a watercraft accessory aggregate. This includes motors, trailers, and equipment. — ref name code."
    },
    {
      "code": "WatercraftRef",
      "display": "This attribute is an identifier reference to a watercraft aggregate. This includes boats, motors, trailers, and equipment.",
      "definition": "This attribute is an identifier reference to a watercraft aggregate. This includes boats, motors, trailers, and equipment. — ref name code."
    },
    {
      "code": "WatercraftRefs",
      "display": "This attribute is an identifier reference to a watercraft aggregate. This includes boats, motors, trailers, and equipment.",
      "definition": "This attribute is an identifier reference to a watercraft aggregate. This includes boats, motors, trailers, and equipment. — ref name code."
    }
  ]
}
